Tekla Open API Reference for Tekla Structures 2025
ControlLine.Line Property
 The line segment defining the position of the control line.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LineSegment Line { get; set; }
Public Property Line As LineSegment
	Get
	Set
Property Value
Type: LineSegment
See Also
Reference
ControlLine Class
Tekla.Structures.Model Namespace